server/tests/load/load.yml
config:
  target: "https://api.freezme.in"
  phases:
    # Warm-up: gentle ramp
    - name: "Warm-up"
      duration: 20
      arrivalRate: 2
    # Ramp-up to realistic peak
    - name: "Ramp-up"
      duration: 40
      arrivalRate: 2
      rampTo: 15
    # Peak: 15 rps — realistic concurrent users
    - name: "Peak"
      duration: 60
      arrivalRate: 15
    # Cool-down
    - name: "Cool-down"
      duration: 20
      arrivalRate: 3
  http:
    timeout: 15
  # Thresholds — p95 < 2s, p99 < 4s on 2xx responses
  ensure:
    p95: 2000
    p99: 4000

scenarios:
  # ── 1. Health check — pure infrastructure check ──────────────────────────────
  - name: "Health check"
    weight: 25
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200

  # ── 2. Auth — low weight, accepts 429 ────────────────────────────────────────
  - name: "Signup + Signin"
    weight: 5
    flow:
      - post:
          url: "/auth/email"
          json:
            email: "load_{{ $randomString() }}_{{ $timestamp }}@freezme.com"
            password: "LoadTest1234!"
            action: "signup"
          capture:
            - json: "$.accessToken"
              as: "accessToken"
      - think: 2
      - delete:
          url: "/users/me"
          headers:
            Authorization: "Bearer {{ accessToken }}"

  # ── 3. Public profile read — uses health endpoint as proxy for unauthenticated ─
  - name: "Public API reads"
    weight: 40
    flow:
      - get:
          url: "/health"
      - think: 1
      - get:
          url: "/health"

  # ── 4. Single-user session — one signup → multiple reads → cleanup ─────────────
  - name: "Authenticated session"
    weight: 20
    flow:
      - post:
          url: "/auth/email"
          json:
            email: "sess_{{ $randomString() }}_{{ $timestamp }}@freezme.com"
            password: "LoadTest1234!"
            action: "signup"
          capture:
            - json: "$.accessToken"
              as: "token"
      - think: 1
      - get:
          url: "/profiles/me"
          headers:
            Authorization: "Bearer {{ token }}"
      - think: 1
      - get:
          url: "/matching/matches"
          headers:
            Authorization: "Bearer {{ token }}"
      - think: 1
      - get:
          url: "/chats"
          headers:
            Authorization: "Bearer {{ token }}"
      - think: 2
      - delete:
          url: "/users/me"
          headers:
            Authorization: "Bearer {{ token }}"

  # ── 5. S3 presigned URL ───────────────────────────────────────────────────────
  - name: "Photo upload URL"
    weight: 10
    flow:
      - post:
          url: "/auth/email"
          json:
            email: "s3_{{ $randomString() }}_{{ $timestamp }}@freezme.com"
            password: "LoadTest1234!"
            action: "signup"
          capture:
            - json: "$.accessToken"
              as: "token"
      - think: 1
      - get:
          url: "/storage/upload-url?filename=photo.jpg&contentType=image/jpeg"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200
      - think: 1
      - delete:
          url: "/users/me"
          headers:
            Authorization: "Bearer {{ token }}"